In [11]:
import pandas as pd
from sqlalchemy import create_engine
import codecs

In [18]:
sets__2020_csv = "sets.csv"
sets_2020_db = pd.read_csv(sets__2020_csv)
sets_2020_db.head()

  set_num                        name  year  theme_id  num_parts
0   001-1                       Gears  1965         1         43
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          0
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [20]:
sets_clean_20_db = sets_2020_db[['theme_id', 'name', 'year']].copy()
sets_clean_20_db.head()

   theme_id                        name  year
0         1                       Gears  1965
1        84           Town Mini-Figures  1978
2       199  Castle 2 for 1 Bonus Offer  1987
3       143          Space Mini-Figures  1979
4       143          Space Mini-Figures  1979

In [6]:
thems_2020_csv = "themes.csv"
thems_2020_db =pd.read_csv(thems_2020_csv)
thems_2020_db.head()

   id            name  parent_id
0   1         Technic        NaN
1   2  Arctic Technic        1.0
2   3     Competition        1.0
3   4  Expert Builder        1.0
4   5           Model        1.0

In [14]:
sets_1950_csv = "sets_1950_2017.csv"
sets_1950_db =pd.read_csv(sets_1950_csv,encoding='latin-1')
sets_1950_db.head()

,Inventory ID,Part Number,Color ID,Color,Transparent Brick,Quantity,Spare Parts,Set Number,Part Name,Part Category,Set Name,Set Category,Set Subcategory,Set Year
0,1,48379c01,72,Dark Bluish Gray,f,1,f,7922-1,Sports Promo Figure Base with Feet,Minifig Accessories,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004
1,1,48395,7,Light Gray,f,1,f,7922-1,Sports Promo Snowboard from McDonald's Sports ...,Minifig Accessories,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004
2,1,mcsport6,25,Orange,f,1,f,7922-1,Sports Promo Figure Head Torso Assembly McDona...,Minifigs,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004
3,1,paddle,0,Black,f,1,f,7922-1,Sports Promo Paddle from McDonald's Sports Sets,Minifig Accessories,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004
4,3,11816pr0005,78,Light Flesh,f,1,f,3931-1,"Minifig Head Modified - Friends - Green Eyes, ...",Minifigs,Emma's Splash Pool,Friends,Friends,2012

In [26]:
sets_clean_1950_db = sets_1950_db[['Inventory ID','Set Name', 'Set Year']].copy()
sets_clean_1950_db.head()

   Inventory ID                                           Set Name  Set Year
0             1  McDonald's Sports Set Number 6 - Orange Vest S...      2004
1             1  McDonald's Sports Set Number 6 - Orange Vest S...      2004
2             1  McDonald's Sports Set Number 6 - Orange Vest S...      2004
3             1  McDonald's Sports Set Number 6 - Orange Vest S...      2004
4             3                                 Emma's Splash Pool      2012